module.exports = {

  area: [
    {
      id: 1,
      name: 'クルザス西部高地',
      pos: [
        {id: 1, name: 'リバーズミート', x: 29, y: 29},
        {id: 2, name: 'ハルドラス像', x: 31, y: 28},
        {id: 3, name: '異端者の坑道', x: 33, y: 25},
        {id: 4, name: 'ナインスヴェアー', x: 37, y: 27},
        {id: 5, name: 'キャンプ・リバーズミート', x: 26, y: 23},
        {id: 6, name: '金床の塔', x: 21, y: 27},
        {id: 7, name: 'イエティの住処', x: 20, y: 32},
        {id: 8, name: 'レッドリム（東）', x: 24, y: 31},
        {id: 9, name: 'レッドリム（北）', x: 21, y: 35},
        {id: 10, name: 'イエティの住処（洞窟）', x: 22, y: 36},
        {id: 11, name: 'レッドリム（西）', x: 16, y: 28},
        {id: 12, name: '聖フィネア連隊の露営地', x: 15, y: 21},
        {id: 13, name: '聖フィネア連隊の露営地（西）', x: 13, y: 23},
        {id: 14, name: '聖フィネア連隊の露営地（東）', x: 18, y: 19},
        {id: 15, name: 'ブラックアイアン・ブリッジ', x: 30, y: 20},
        {id: 16, name: 'ヘムロック', x: 35, y: 18},
        {id: 17, name: 'オーカム波止場', x: 37, y: 12},
        {id: 18, name: 'オーカム波止場', x: 36, y: 9},
        {id: 19, name: 'ノーススター号', x: 31, y: 8},
        {id: 20, name: 'ゴルガニュ牧草地', x: 31, y: 12},
        {id: 21, name: 'クルザス川', x: 24, y: 14},
        {id: 22, name: '聖フィネア連隊の露営地（北）', x: 15, y: 16},
        {id: 23, name: 'アッシュプール', x: 10, y: 17},
        {id: 24, name: 'ツインプールズ（西端）', x: 9, y: 12},
        {id: 25, name: 'ドラゴンスピット', x: 10, y: 6},
        {id: 26, name: 'スレート連峰', x: 14, y: 8},
        {id: 27, name: 'ツインプールズ', x: 17, y: 12},
        {id: 28, name: 'ベーンプール', x: 19, y: 18},
        {id: 29, name: 'クルザス川', x: 25, y: 11}
      ],
      mobs:[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25]
    },
    {
      id: 2,
      name: '高地ドラヴァニア',
      pos: [
        {id: 1, name: 'チョコボの森', x: 37 , y: 23},
        {id: 2, name: 'つつやき小道', x: 38, y: 19},
        {id: 3, name: 'チョコボの森（北東）', x: 33, y: 15},
        {id: 4, name: 'チョコボの森（離れ）', x: 38, y: 13},
        {id: 5, name: '餌食の大地', x: 31, y: 8},
        {id: 6, name: '餌食の大地', x: 27, y: 8},
        {id: 7, name: 'チョコボの森（北西）', x: 27, y: 13},
        {id: 8, name: '邪竜の彫像', x: 25, y: 21},
        {id: 9, name: 'テイルフェザー西', x: 29, y: 25},
        {id: 10, name: 'スモーキングウェイスト', x: 28, y: 28},
        {id: 11, name: 'スモーキングウェイスト', x: 29, y: 32},
        {id: 12, name: 'グナースの塚', x: 28, y: 36},
        {id: 13, name: 'ウィロームリバー', x: 26, y: 26},
        {id: 14, name: 'ウィロームリバー（下流）', x: 21, y: 35},
        {id: 15, name: '不浄の集落', x: 12, y: 39},
        {id: 16, name: 'アヴァロニア・フォールン', x: 13, y: 34},
        {id: 17, name: 'ダンナー街道', x: 18, y: 29},
        {id: 18, name: '不浄の三塔（周辺）', x: 18, y: 25},
        {id: 19, name: 'モーン大岩窟', x: 12, y: 10},
        {id: 20, name: 'ソール・アム山麓', x: 19, y: 13}
      ],
      mobs:[26,27,28,29,30,31,32,33,34,35,36,37,38,39,
        40,41,42,43,44,45,46,47,48,49,50,51,52,53,54]
    },
    {
      id: 3,
      name: 'ドラヴァニア雲海',
      pos: [
        {id: 1, name: 'モグモグホーム北', x: 30, y: 32},
        {id: 2, name: 'ランロード遺構', x: 29, y: 28},
        {id: 3, name: 'エイル・トーム（モグモグホーム側）', x: 33, y: 31},
        {id: 4, name: 'エイル・トーム（湖周辺）', x: 36, y: 32},
        {id: 5, name: 'エイル・トーム（手紙の家側）', x: 36, y: 26},
        {id: 6, name: '手紙の家', x: 34, y: 22},
        {id: 7, name: 'モンステリエ', x: 33, y: 15},
        {id: 8, name: 'ランロード遺構', x: 26, y: 19},
        {id: 9, name: 'ランロード遺構', x: 25, y: 23},
        {id: 10, name: 'ランロード遺構', x: 21, y: 29},
        {id: 11, name: 'フォーアームズ', x: 18, y: 28},
        {id: 12, name: 'フォーアームズ', x: 14, y: 31},
        {id: 13, name: 'グリーンスウォード島', x: 9, y: 36},
        {id: 14, name: 'オール・ターン', x: 16, y: 23},
        {id: 15, name: '飛竜泊', x: 20, y: 17},
        {id: 16, name: 'グロン・レイ', x: 11, y: 18},
        {id: 17, name: 'サウストン・ウォール', x: 7, y: 19},
        {id: 18, name: 'オール・ターン', x: 7, y: 13},
        {id: 19, name: 'ウエストン・ウォーター', x: 6, y: 8},
        {id: 20, name: 'オール・ターン', x: 14, y: 13},
        {id: 21, name: 'サルウーム・カシュ', x: 18, y: 9},
        {id: 22, name: 'イーストン・アイ', x: 28, y: 10}
      ],
      mobs: [55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74]
    },
    {
      id: 4,
      name: 'アバラシア雲海',
      pos: [1,2,3,4,5,6,7,8,9,10],
      mobs: [75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,
        90,91,92,93,94,95,96,97,98,99,
        100,101,102,103,104,105,106,107,108,109,
        110,111,112]
    },
    {
      id: 5,
      name: '低地ドラヴァニア',
      pos: [1,2,3,4,5,6,7,8,9,10],
      mobs: [113,114,115,116,117,118,119,
        120,121,122,123,124,125,126,127,128,129,130,131,132]
    },
    {
      id: 6,
      name: 'アジス・ラー',
      pos: [1,2,3,4,5,6,7,8,9,10],
      mobs: [133,134,135,136,137,138,139,
        140,141,142,143,144,145,146,147,148,149,
        150,151,152,153,154,155,156, 157,158,159,160,161,162,163,164]
    }
  ],

  mob: [
    {id: 1, lv: 50, name: 'アイストラップ', pos: [21], area: 1},
    {id: 2, lv: 50, name: 'アップランド・ミロドン', pos: [15], area: 1}, //上級 x3 リバーズミート 30,20
    {id: 3, lv: 50, name: 'ゴールドウィンド・バテラー', pos: [20], area: 1},
    {id: 4, lv: 50, name: 'シルバーウルフ', pos:[4, 17], area: 1},//初級x3
    {id: 5, lv: 50, name: 'スタインボック', pos:[1], area: 1, difficulty: 1},
    {id: 6, lv: 50, name: 'スラッシュゾブラン', pos: [29], area: 1},
    {id: 7, lv: 50, name: 'ディープアイ', pos:[2], area: 1},
    {id: 8, lv: 50, name: 'フロストグレネード', pos: [20], area: 1},//上級x2
    {id: 9, lv: 50, name: 'ベルグスルス', pos:[3], area: 1}, // 初級 x2 リバーズミート 33,25
    {id: 10, lv: 51, name: 'アイスコマンダー', pos: [24], area: 1},
    {id: 11, lv: 51, name: 'アルケオーニス', pos:[26, 27], area: 1},//初級 x3 中級x3
    {id: 12, lv: 51, name: 'ウーリーヤク', pos: [22], area: 1},//上級 x2
    {id: 13, lv: 51, name: 'ジェラート', pos:[28], area: 1},
    {id: 14, lv: 51, name: 'ポーラーベアー', pos:[14], area: 1},//初級 x3
    {id: 15, lv: 51, name: 'ルーム', pos:[7, 12, 24], area: 1},
    {id: 16, lv: 51, name: 'ローン・イエティ', pos:[7, 10], area: 1},//中級 x2 初級x2 上級x2
    {id: 17, lv: 56, name: 'アイスコマンダー', pos:[25], area: 1},
    {id: 18, lv: 56, name: 'アイスゾブラン', pos: [8, 11], area: 1},
    {id: 19, lv: 56, name: 'インランド・トゥルスス', pos: [19], area: 1},
    {id: 20, lv: 56, name: 'ウィンドスルス', pos: [25], area: 1},
    {id: 21, lv: 56, name: 'グランド・アルケオーニス', pos: [16], area: 1},
    {id: 22, lv: 56, name: 'スレート・イエティ', pos: [8, 11], area: 1}, //24,31
    {id: 23, lv: 56, name: 'スリートトラップ', pos: [18], area: 1},
    {id: 24, lv: 56, name: 'ソルベ', pos: [6], area: 1},
    {id: 25, lv: 56, name: 'フリーズドラゴン', pos: [13], area: 1},

    //高地ドラヴァニア
    {id: 26, lv: 51, name: 'ロス・カルティベーター', pos: [12], area: 2},
    {id: 27, lv: 51, name: 'ロス・スチールドローン', pos: [12], area: 2},
    {id: 28, lv: 51, name: 'ロス・ファイアドローン', pos: [12], area: 2},
    {id: 29, lv: 52, name: 'グナース・カルディベーター', pos: [12], area: 2},
    {id: 30, lv: 52, name: 'グナース・ファイアドローン', pos: [12], area: 2},
    {id: 31, lv: 52, name: 'ドラゴンフライ・ウォッチャー',pos: [11], area: 2},
    {id: 32, lv: 52, name: 'ドラヴァニアン・エイビス', pos: [8], area: 2},
    {id: 33, lv: 52, name: 'バンダースナッチ', pos: [3], area: 2},
    {id: 34, lv: 52, name: 'フェザーフリー', pos: [2], area: 2},//初級 x3
    {id: 35, lv: 52, name: 'ブラウンベアー', pos: [7], area: 2},
    {id: 36, lv: 52, name: 'メリアエ', pos: [8,9], area: 2},//初級x2
    {id: 37, lv: 52, name: 'リバー・ニンキナンカ', pos: [13], area: 2}, //初級 x2
    {id: 38, lv: 52, name: 'リバー・ナンカ', pos: [13], area: 2},
    {id: 39, lv: 52, name: 'ロフタン', pos: [10], area: 2},//中級 x3
    {id: 40, lv: 52, name: 'ワイルドチョコボ', pos: [1], area: 2},
    {id: 41, lv: 53, name: 'ガッリミムス', pos: [20], area: 2}, //初級x3 中級 x3 上級x3
    {id: 42, lv: 53, name: 'グナース・フォリジャー', pos: [12], area: 2},
    {id: 43, lv: 53, name: 'グナース・ヘイルドローン', pos: [12], area: 2},
    {id: 44, lv: 53, name: 'グナース・アイアンドローン', pos: [12], area: 2},
    {id: 45, lv: 53, name: 'シリクタ', pos: [19], area: 2},//中級x2
    {id: 46, lv: 53, name: 'ティラノサウルス', pos: [19], area: 2},//初級x2
    {id: 47, lv: 53, name: 'ドラヴァニアン・ワイバーン', pos: [16], area: 2},
    {id: 48, lv: 53, name: 'ビネガロン', pos: [19], area: 2}, //上級 x2
    {id: 49, lv: 53, name: 'フォーランド・ヒッポセルフ', pos: [18], area: 2},//中級x3
    {id: 50, lv: 53, name: 'ミアキス', pos: [17], area: 2},//初級x3
    {id: 51, lv: 57, name: 'ゴールデン・バンダースナッチ', pos: [4,6], area: 2},
    {id: 52, lv: 57, name: 'サンダードラゴン', pos: [5], area: 2},
    {id: 53, lv: 57, name: 'ドラゴンフライ・トレーサー', pos: [5], area: 2},
    {id: 54, lv: 57, name: 'ボーンエイビス', pos: [15], area: 2},

    //ドラヴァニア雲海
    {id: 55, lv: 54, name: 'アルケオダイノス', pos: [5], area: 3},
    {id: 56, lv: 54, name: 'アンフィプテレ', pos: [12], area: 3},
    {id: 57, lv: 54, name: 'ウアジェット', pos: [8], area: 3}, //上級 x2 中級x2
    {id: 58, lv: 54, name: 'サンクチンニ', pos: [1,2], area: 3},//上級x3
    {id: 59, lv: 54, name: 'トゥリヘンド', pos: [7], area: 3},
    {id: 60, lv: 54, name: 'モスドラゴン', pos: [9], area: 3},
    {id: 61, lv: 54, name: 'レッサードラゴン', pos: [11], area: 3}, //中級 x2
    {id: 62, lv: 54, name: 'ロプケン', pos: [4], area: 3},
    {id: 63, lv: 55, name: 'ヴィーヴル', pos: [15], area: 3},//中級x2
    {id: 64, lv: 55, name: 'エルダーシリクタ', pos: [6], area: 3},
    {id: 65, lv: 55, name: 'エルダーワイバーン', pos: [10], area: 3},
    {id: 66, lv: 55, name: 'ドラゴネット', pos: [21], area: 3},//中級x3
    {id: 67, lv: 55, name: 'ナールド・メリアエ', pos: [16], area: 3},
    {id: 68, lv: 55, name: 'ブレード・ビネガロン', pos: [14], area: 3},//上級x2
    {id: 69, lv: 55, name: 'ミスト・ドレイク', pos: [20], area: 3},
    {id: 70, lv: 55, name: 'ミスト・ビアスト', pos: [3], area: 3},//上級 x2 中級x2
    {id: 71, lv: 55, name: 'ライム・ゴーレム', pos: [18], area: 3},
    {id: 72, lv: 56, name: 'ウェアドラゴン', pos: [19], area: 3}, //中級 x3
    {id: 73, lv: 56, name: 'クラウドエイビス', pos: [13], area: 3},
    {id: 74, lv: 56, name: 'ブラッドドラゴン', pos: [22], area: 3},//中級x1

    //アバラシア雲海
    {id: 75, lv: 50, name: 'オブデラ', pos: [], area: 4},
    {id: 76, lv: 50, name: 'ガストルニス', pos: [], area: 4},//中級x2
    {id: 77, lv: 50, name: 'ゲイラキャット', pos: [], area: 4}, //中級 x3
    {id: 78, lv: 50, name: 'クラウドウォーム', pos: [], area: 4}, ///初級 x1　中級x1
    {id: 79, lv: 50, name: 'コノドント', pos: [], area: 4},//初級x1
    {id: 80, lv: 50, name: 'パイッサ', pos: [], area: 4},
    {id: 81, lv: 51, name: 'ウグライ・グンド', pos: [], area: 4},
    {id: 82, lv: 51, name: 'サヌワ', pos: [], area: 4},//初級x1
    {id: 83, lv: 51, name: 'ナツライ・グンド', pos: [], area: 4},//初級x1
    {id: 84, lv: 51, name: 'ランライ・グンド', pos: [], area: 4}, //初級 x1
    {id: 85, lv: 56, name: 'ウィセント', pos: [], area: 4}, //中級 x2
    {id: 86, lv: 56, name: 'ダルメル', pos: [], area: 4},
    {id: 87, lv: 56, name: 'ワイリー・パイッサ', pos: [], area: 4},
    {id: 88, lv: 57, name: 'アバラシア・カイト', pos: [], area: 4},
    {id: 89, lv: 57, name: 'ウィンドウ・ワモーラ', pos: [], area: 4},
    {id: 90, lv: 57, name: 'ウィンドウ・ワモーラカンパ', pos: [], area: 4},//上級 x2
    {id: 91, lv: 57, name: 'ウグライ・ブンド', pos: [], area: 4},
    {id: 92, lv: 57, name: 'エンディミオン', pos: [], area: 4},
    {id: 93, lv: 57, name: 'グランズキーパー', pos: [], area: 4},
    {id: 94, lv: 57, name: 'サヌワ・ブンド', pos: [], area: 4},
    {id: 95, lv: 57, name: 'ブンド・トーテム', pos: [], area: 4},//上級x3
    {id: 96, lv: 57, name: 'ナツライ・ブンド', pos: [], area: 4},
    {id: 97, lv: 57, name: 'ランライ・ブンド', pos: [], area: 4},
    {id: 98, lv: 57, name: 'VIレギオン・イマギニファー', pos: [], area: 4},
    {id: 99, lv: 57, name: 'VIレギオン・トリアリウス', pos: [], area: 4},
    {id: 100, lv: 57, name: 'VIレギオン・ミュルミッロ', pos: [], area: 4},
    {id: 101, lv: 57, name: 'VIレギオン・ベスティアリウス', pos: [], area: 4},
    {id: 102, lv: 57, name: 'VIレギオン・ヴェリス', pos: [], area: 4},
    {id: 103, lv: 59, name: 'アンズー', pos: [], area: 4},
    {id: 104, lv: 59, name: 'ヴグロイ・ブンド', pos: [], area: 4},
    {id: 105, lv: 59, name: 'オサヌワ・ブモラ', pos: [], area: 4},
    {id: 106, lv: 59, name: 'グリフィン', pos: [], area: 4},
    {id: 107, lv: 59, name: 'コリガン', pos: [], area: 4},
    {id: 108, lv: 59, name: 'ツィナハレ', pos: [], area: 4},
    {id: 109, lv: 59, name: 'トコトコ', pos: [], area: 4},
    {id: 110, lv: 59, name: 'ナツロイ・ブンド', pos: [], area: 4},
    {id: 111, lv: 59, name: 'モッキンバード・トーテム', pos: [], area: 4},
    {id: 112, lv: 59, name: 'ランロイ・ブンド', pos: [], area: 4},

    //低地ドラヴァニア
    {id: 113, lv: 58, name: 'オーン・コリブリ', pos: [], area: 5},
    {id: 114, lv: 58, name: 'クロウラー', pos: [], area: 5},
    {id: 115, lv: 58, name: 'ゴブリン・グライダー', pos: [], area: 5},
    {id: 116, lv: 58, name: 'ゴブリン・シャープシューター', pos: [], area: 5},
    {id: 117, lv: 58, name: 'ゴブリン・ティンカラー', pos: [], area: 5},
    {id: 118, lv: 58, name: 'ゴブリン・ブランディッシャー', pos: [], area: 5},//上級x1
    {id: 119, lv: 58, name: 'サンベアー', pos: [], area: 5},
    {id: 120, lv: 59, name: 'サンリーチ', pos: [], area: 5}, //上級 x2
    {id: 121, lv: 58, name: 'ダムゼルフライ', pos: [], area: 5},
    {id: 122, lv: 58, name: 'タランチュラホーク', pos: [], area: 5},
    {id: 123, lv: 58, name: 'ナルブルーイ', pos: [], area: 5},
    {id: 124, lv: 58, name: 'モルボルグレート', pos: [], area: 5},
    {id: 125, lv: 58, name: 'ラーテル', pos: [], area: 5},
    {id: 126, lv: 58, name: 'ワイルドビースト', pos: [], area: 5},
    {id: 127, lv: 58, name: 'III号ゴブリガードE型', pos: [], area: 5},
    {id: 128, lv: 59, name: 'オーケアニス', pos: [], area: 5},
    {id: 129, lv: 59, name: 'オプケン', pos: [], area: 5},//上級x3
    {id: 130, lv: 59, name: 'コカトリス', pos: [], area: 5},
    {id: 131, lv: 59, name: 'ピフェリケラス', pos: [], area: 5},
    {id: 132, lv: 59, name: 'ポロッゴ', pos: [], area: 5},

    //アジス・ラー
    {id: 133,lv: 59,name: "アラガンワーク・エンジニア",pos: [],area: 6},
    {id: 134,lv: 59,name: "アラガン・キマイラ",pos: [],area: 6},
    {id: 135,lv: 59,name: "アラガンワーク・ハーベストマン",pos: [],area: 6}, //上級 x3
    {id: 136,lv: 59,name: "アラガンワーク・パラディン",pos: [],area: 6},
    {id: 137,lv: 59,name: "アラガン・ワークビット",pos: [],area: 6},
    {id: 138,lv: 59,name: "エンフォースドロイド",pos: [],area: 6},
    {id: 139,lv: 59,name: "エンプーサ",pos: [],area: 6},
    {id: 140,lv: 59,name: "オウルベア",pos: [],area: 6},//上級x3
    {id: 141,lv: 59,name: "コープスフラワー",pos: [],area: 6},
    {id: 142,lv: 59,name: "プロトナーガ",pos: [],area: 6},
    {id: 143,lv: 59,name: "魔導アダマンクロー",pos: [],area: 6},
    {id: 144,lv: 59,name: "魔導コロッサスIII",pos: [],area: 6},
    {id: 145,lv: 59,name: "メラシディアン・アンフィプテレ",pos: [],area: 6},
    {id: 146,lv: 59,name: "メラシディアン・ヴィーヴル",pos: [],area: 6},//上級xx1
    {id: 147,lv: 59,name: "メラシディアン・ドラゴネット",pos: [],area: 6},
    {id: 148,lv: 59,name: "メラシディアン・ドラゴン",pos: [],area: 6},
    {id: 149,lv: 59,name: "メラシディアン・ファラク",pos: [],area: 6},
    {id: 150,lv: 59,name: "メラシディアン・プロビニャク",pos: [],area: 6},
    {id: 151,lv: 59,name: "ラミア・サイブリッド",pos: [],area: 6},
    {id: 152,lv: 59,name: "ラミア・テリトーク",pos: [],area: 6},
    {id: 153,lv: 59,name: "レッサーハイドラ",pos: [],area: 6},
    {id: 154,lv: 59,name: "レプトイド",pos: [],area: 6},
    {id: 155,lv: 59,name: "ルークスナッパー",pos: [],area: 6},
    {id: 156,lv: 59,name: "VIレギオン・ビット",pos: [],area: 6},
    {id: 157,lv: 59,name: "VIレギオン・シグニフェル",pos: [],area: 6},
    {id: 158,lv: 59,name: "VIレギオン・ラクエリウス",pos: [],area: 6},
    {id: 159,lv: 59,name: "VIレギオン・ホプロマクス",pos: [],area: 6},
    {id: 160,lv: 59,name: "VIレギオン・セクトール",pos: [],area: 6},
    {id: 161,lv: 59,name: "VIレギオン・ヴァンガード",pos: [],area: 6},
    {id: 162,lv: 59,name: "VIレギオン・エクエス",pos: [],area: 6},
    {id: 163,lv: 60,name: "ウォースバイト",pos: [],area: 6},
    {id: 164,lv: 60,name: "スフィンクス",pos: [],area: 6}
  ]

};
